CSI API ETABS v1

# eFrameDesignOrientation Enumeration

---

The possible design orientations for a frame.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eFrameDesignOrientation

    Public Enumeration eFrameDesignOrientation

    Dim instance As eFrameDesignOrientation

    public enum class eFrameDesignOrientation

    type eFrameDesignOrientation

Members

| Member name| Value| Description
---|---|---|---
| Column| 1|
| Beam| 2|
| Brace| 3|
| Null| 4|
| Other| 5|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com